app/controllers/administration_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "users" SET "is_admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_admin", 1], ["updated_at", "2018-09-17 15:04:55.102383"], ["id", 15]]
---
	def promote
		if (current_user.id != params[:id])
			User.find(params[:id]).update_attribute(:is_admin, true)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "users" SET "is_admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_admin", 0], ["updated_at", "2018-09-10 11:08:09.475494"], ["id", 15]]
---
	def demote
		if (current_user.id != params[:id])
			User.find(params[:id]).update_attribute(:is_admin, false)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 17]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
	def ban_user
		User.find(params[:id]).destroy