app/controllers/cars_controller.rb

INSERT INTO "cars" ("model", "battery_capacity", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["model", "Tesla S 85"], ["battery_capacity", 85], ["user_id", 5], ["created_at", "2018-09-09 15:46:56.359971"], ["updated_at", "2018-09-09 15:46:56.359971"]]
---
	def create
		@car = current_user.cars.build(car_params)
		if @car.save

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def edit
		@car = Car.find_by_id([params[:id]])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "cars" SET "model" = ?, "battery_capacity" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["model", "Tesla S"], ["battery_capacity", 100], ["updated_at", "2018-09-09 15:43:06.215513"], ["id", 3]]
---
	def update
		@car = Car.find_by_id([params[:id]])
		if @car.update_attributes(car_params)

SELECT "cars"."id" FROM "cars" WHERE "cars"."user_id" = ?  [["user_id", 5]]
---
	def check_ownership!
		if (!current_user.cars.ids.include?(params[:id].to_i))