app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "reviews"
---
	def index
		@reviews = Review.paginate(page: params[:page])

INSERT INTO "reviews" ("content", "rating", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Bello"], ["rating", 5], ["user_id", 5], ["created_at", "2018-09-10 11:08:21.564255"], ["updated_at", "2018-09-10 11:08:21.564255"]]
---
	def create
		@review = current_user.build_review(review_params)
		if @review.save