app/controllers/static_pages_controller.rb

SELECT "charging_points".* FROM "charging_points" WHERE (longitude >= 11.11667 AND longitude <= 12.48278 AND latitude >= 41.89306 AND latitude <= 43.979865000000004)
---
                query = "longitude >= ? AND longitude <= ? AND latitude >= ? AND latitude <= ?"
                middle_lat = max_lat - (max_lat - min_lat) / 2
                ch_po = sector == 1 ? ChargingPoint.where(query, min_lon, max_lon, middle_lat, max_lat) :
                                      ChargingPoint.where(query, min_lon, max_lon, min_lat, middle_lat)

SELECT  1 AS one FROM "cars" WHERE "cars"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
---
    def check_car_presence!
        if (current_user.cars.empty?)