app/models/user.rb

    def self.from_omniauth(access_token)
        data = access_token.info
        user = User.where(email: data['email']).first

        unless user
            user = User.create(name: data['name'],
                email: data['email'],
                password: Devise.friendly_token[0,20]
            )
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "daquanno.1712078@studenti.uniroma1.it"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)